org/how_to_write_a_technical_paper.org
:PROPERTIES:
:ID:       2b16b190-7691-4798-b532-bec960f6ba2b
:END:
#+title: How To Write a Technical Paper

- tags :: [[id:464665d4-0806-422b-b984-e65bb0120e9f][Writing]], [[id:e45f2c4d-052e-48e7-b985-d9330d7a835d][Papers]]
- paper :: cite:Whiteside2017HowTW

* Abstract
The abstract is what the reader reads to determine if the paper is
worthy of merit for further study. It should contain:

1. Brief introduction describing the discipline
2. A concise statement of the problem
3. A brief explanation of the solution and its key ideas
4. A brief description of the results obtained and their impacts

* Introduction
Gives background on and motivation for research, establishing its
importance. Consider technological trends, recent promising
developments. 

The summary should include a problem description, which is more
detailed than the abstract. Close with a description of the paper
outline, what sections it contains and what the reader will find in each.

* Related Work
- Shows what has happened in the field
- Provides a critique of the approaches in the literature

* System Model
Describes all hypotheses and assumptions of the environment on which
the problem will be stated. Realize both explicit and implicit
assumptions.

* Problem Statement
State the problem clearly, being as exact as possible.

* Solution
First, provide an overview of the solution. Give rationale, explain
concepts and mechanisms. Next, provide a detailed description of the
solution and its functionality. Figures are often helpful.

* Analysis
Perform qualitative and quantitative analysis on the solution. This
includes proof of correctness, and performance analysis.

* Simulation and Experimentation
Establish that the experimental setup is statistically stable. Explain
each experiment and caption each figure appropriately.

* Conclusion
The conclusion sections elaborates on the impacts of using your
approach. It also states limitations or disadvantages of your
solution, and enables you to provide directions for future research in
the field.


bibliography:biblio.bib
