content/posts/how_to_write_a_technical_paper.md
+++
title = "How To Write a Technical Paper"
author = ["Jethro Kuan"]
lastmod = 2020-07-17T00:57:53+08:00
draft = false
+++

tags
: [Writing]({{< relref "writing" >}}), [Papers]({{< relref "papers" >}})

paper
: ([Whiteside, n.d.](#org393d6fa))

## Abstract {#abstract}

The abstract is what the reader reads to determine if the paper is
worthy of merit for further study. It should contain:

1.  Brief introduction describing the discipline
2.  A concise statement of the problem
3.  A brief explanation of the solution and its key ideas
4.  A brief description of the results obtained and their impacts

## Introduction {#introduction}

Gives background on and motivation for research, establishing its
importance. Consider technological trends, recent promising
developments.

The summary should include a problem description, which is more
detailed than the abstract. Close with a description of the paper
outline, what sections it contains and what the reader will find in each.

## Related Work {#related-work}

- Shows what has happened in the field
- Provides a critique of the approaches in the literature

## System Model {#system-model}

Describes all hypotheses and assumptions of the environment on which
the problem will be stated. Realize both explicit and implicit
assumptions.

## Problem Statement {#problem-statement}

State the problem clearly, being as exact as possible.

## Solution {#solution}

First, provide an overview of the solution. Give rationale, explain
concepts and mechanisms. Next, provide a detailed description of the
solution and its functionality. Figures are often helpful.

## Analysis {#analysis}

Perform qualitative and quantitative analysis on the solution. This
includes proof of correctness, and performance analysis.

## Simulation and Experimentation {#simulation-and-experimentation}

Establish that the experimental setup is statistically stable. Explain
each experiment and caption each figure appropriately.

## Conclusion {#conclusion}

The conclusion sections elaborates on the impacts of using your
approach. It also states limitations or disadvantages of your
solution, and enables you to provide directions for future research in
the field.

## Bibliography {#bibliography}

<a id="org393d6fa"></a>Whiteside, James D. n.d. “How to Write a Technical Paper.”
